[
  {
    "empresa": "Exército Brasileiro - 2º Centro de Geoinformação (2º CGEO)",
    "cargo": "3º Sargento",
    "periodo": "Mar/2011 - Fev/2019",
    "descricao": "Como 3º Sargento no Exército Brasileiro, atuei como administrador de servidores em ambiente Linux, sendo responsável pelo gerenciamento e configuração dos servidores DHCP, SAMBA, SQUID, NAGIUS, LDAP, WEBMAIL, SPED e SISBOL. Além disso, liderei a manutenção do site e da intranet da OM, garantindo o pleno funcionamento e atualização dos mesmos. Tive a responsabilidade de realizar a configuração de switches de borda, garantindo a estabilidade e segurança da infraestrutura de rede. Além disso, fui encarregado da manutenção de storages e VMs (máquinas virtuais), assegurando a disponibilidade e desempenho adequados dos sistemas. Desempenhei um papel fundamental na implementação e manutenção de servidores de sistema de segurança, garantindo a proteção dos dados e a integridade das informações. Também fui responsável pela manutenção das máquinas de todo o parque, assegurando o pleno funcionamento dos equipamentos. Além das atividades técnicas, também desempenhei funções administrativas relacionadas à administração pública, como participação em licitações e fiscalização de contratos. Também ministrei instruções de aulas de informática, compartilhando meus conhecimentos e auxiliando no desenvolvimento das habilidades dos colegas."
  },
  {
    "empresa": "Aprimora Conhecimento",
    "cargo": "Desenvolvedor Web FullStack",
    "periodo": "Jan/2024",
    "descricao": "Desenvolvimento de APIs robustas e eficientes utilizando TypeScript, JavaScript, Node.js, Prisma e Express para fornecer soluções escaláveis e de alto desempenho. Colaboração no desenvolvimento e manutenção de sistemas fullstack, utilizando tecnologias como React.js para criar interfaces modernas e interativas. Implementação de bases de dados, incluindo MySQL e PostgreSQL, garantindo eficiência no armazenamento e recuperação de dados. Experiência em desenvolvimento com React.js, Next.js e Vue.js para criar interfaces de usuário dinâmicas e responsivas. Participação ativa em reuniões de equipe, contribuindo para o planejamento e execução de projetos. Conhecimento em gerenciamento de banco de dados, otimização de consultas e modelagem de dados. Utilização de metodologias ágeis para melhorar a eficiência e a entrega de projetos."
  }
  
]